programming/20230601215350-rest_api_s_in_common_lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-14 Fri 07:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rest Api's in common lisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Rest Api&rsquo;s in common lisp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf693d40">Rest API in common lisp</a>
<ul>
<li><a href="#orgd7c8472">Get</a></li>
<li><a href="#org69ebd0e">post</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgf693d40" class="outline-2">
<h2 id="orgf693d40">Rest API in common lisp</h2>
<div class="outline-text-2" id="text-orgf693d40">
<p>
In common lisp there are many library&rsquo;s to complete a task, some are old but still work just fine.
A good fast library to use is <a href="https://github.com/fukamachi/dexador">dexador</a>. It is much faster then <a href="https://github.com/edicl/drakma">drakama</a>. As for json i recommend <a href="https://github.com/madnificent/jsown">jsown</a>.
</p>

<p>
<code>dexador</code> also takes uris as arguments, so I recommend using <a href="https://github.com/fukamachi/quri">quri</a>.
</p>


<p>
<b>NOTE</b>: It is imperative you set the content type in your headers, by default dexador will use <code>application/x-www-form-urlencoded</code><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>!
</p>

<p>
Internally it uses connection pooling and reuses connections.
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>ql:quickload '<span style="color: #ff2afc;">(</span><span style="color: #1ea8fc;">:dexador</span> <span style="color: #1ea8fc;">:cl-json</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>dex:post <span style="color: #7984D1;">"https://httpbin.org/post"</span>
          <span style="color: #1ea8fc;">:headers</span> '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #1ea8fc;">:content-type</span> . <span style="color: #7984D1;">"application/json"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
          <span style="color: #1ea8fc;">:content</span> &lt;json-data&gt;<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgd7c8472" class="outline-3">
<h3 id="orgd7c8472">Get</h3>
<div class="outline-text-3" id="text-orgd7c8472">
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>dex:get <span style="color: #7984D1;">"http://lisp.org"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org69ebd0e" class="outline-3">
<h3 id="org69ebd0e">post</h3>
<div class="outline-text-3" id="text-org69ebd0e">
<p>
To send formdata in a post use a association list.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>dex:post <span style="color: #7984D1;">"https://httpbin.org/anything/post"</span>  <span style="color: #1ea8fc;">:content</span> '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"hello"</span> . <span style="color: #7984D1;">"world"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
<p>
&ldquo;{
  &rdquo;args&ldquo;: {},
  &rdquo;data&ldquo;: &rdquo;&ldquo;,
  &rdquo;files&ldquo;: {},
  &rdquo;form&ldquo;: {
    &rdquo;hello&ldquo;: &rdquo;world&ldquo;
  },
  &rdquo;headers&ldquo;: {
    &rdquo;Accept&ldquo;: &rdquo;<b>/</b>&ldquo;,
    &rdquo;Content-Length&ldquo;: &rdquo;11&ldquo;,
    &rdquo;Content-Type&ldquo;: &rdquo;application/x-www-form-url&#x2026;[sly-elided string of length 499]&ldquo;
200
#&lt;HASH-TABLE :TEST EQUAL :COUNT 7 {1003F9A5A3}&gt;
#&lt;QURI.URI.<a href="URI-HTTPS">URI-HTTPS</a> <a href="https://httpbin.org/anything/post">https://httpbin.org/anything/post</a>&gt;
NIL
</p>

<p>
To use json you need to set the appropriate headers.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>setq *headers*  '<span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"accept"</span> . <span style="color: #7984D1;">"application/json"</span><span style="color: #a7da1e;">)</span>
                   <span style="color: #a7da1e;">(</span><span style="color: #7984D1;">"Content-Type"</span> . <span style="color: #7984D1;">"application/json"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
<p>
((&ldquo;accept&rdquo; . &ldquo;application/json&rdquo;) (&ldquo;Content-Type&rdquo; . &ldquo;application/json&rdquo;))
</p>

<p>
Then you can pass the headers and json like so
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #1ea8fc;">(</span>ql:quickload <span style="color: #1ea8fc;">:jsown</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span>dex:post <span style="color: #7984D1;">"https://httpbin.org/anything/post"</span> <span style="color: #1ea8fc;">:headers</span> *headers*  <span style="color: #1ea8fc;">:content</span> <span style="color: #ff2afc;">(</span>jsown:to-json <span style="color: #a7da1e;">(</span>jsown:new-js <span style="color: #df85ff;">(</span><span style="color: #7984D1;">"key"</span> <span style="color: #7984D1;">"value"</span><span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
<p>
&ldquo;{
  &rdquo;args&ldquo;: {},
  &rdquo;data&ldquo;: &rdquo;{\&ldquo;key\&rdquo;:\&ldquo;value\&rdquo;}&ldquo;,
  &rdquo;files&ldquo;: {},
  &rdquo;form&ldquo;: {},
  &rdquo;headers&ldquo;: {
    &rdquo;Accept&ldquo;: &rdquo;application/json&ldquo;,
    &rdquo;Content-Length&ldquo;: &rdquo;15&ldquo;,
    &rdquo;Content-Type&ldquo;: &rdquo;application/json&ldquo;,&#x2026;[sly-elided string of length 510]&rdquo;
200
#&lt;HASH-TABLE :TEST EQUAL :COUNT 7 {1004198BC3}&gt;
#&lt;QURI.URI.<a href="URI-HTTPS">URI-HTTPS</a> <a href="https://httpbin.org/anything/post">https://httpbin.org/anything/post</a>&gt;
NIL
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://archive.ph/UPxN4">https://archive.ph/UPxN4</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p>
<p class="validation"></p>
</div>
</body>
</html>